{
  "overview": "There is a lack of quantitative data on how penguins incubate their eggs. Currently, most data on penguin behaviour are collected through means of observation. The actual incubation parameters of penguin eggs are also unknown and are often inferred from other bird species.\n\nThe Smart Penguin Egg Project aims to aid The Shedd Aquarium’s understanding of penguin egg incubation by designing and manufacturing a smart penguin egg. It measures and stores time-stamped data of positional orientation, applied pressure, applied temperature, and ambient humidity. The collection and visualization of this data will help them learn how to effectively incubate and care for penguin eggs.\n",
  "process": "Apart from focusing on technical challenges like ensuring robustness and optimising sensor responsiveness, my team also wanted to look into the usability of our product like ease of operation, ease of troubleshooting and maintenance, and also intuitiveness of data access and visualisation platforms.\n\nThe complexity of the project grew exponentially as more performance requirements and constraints were introduced, such as battery life and the size and weight of the egg. We therefore decided to breakdown our project into many iterations, tackling one problem at a time. We started off with an egg that only measures temperature and orientation, and added more features in next few iterations and optimising them as we went along.\n\nThroughout this whole process, we worked really closely with the penguin handlers at The Shedd Aquarium to design and test multiple iterations of our smart penguin egg on a fortnightly basis.\n",
  "detail1": "We experimented with different egg housings by 3D printing PLA eggs of different thickness and curvatures. We wanted to find the housing with the optimal strength, flexibility, and heat permeability. /nIn order to measure ambient humidity, we also needed the egg housing to be porous yet waterproof. We explored multiple options with different hole sizes and different materials like silicon and PDMS before settling on our final prototype. Our final version comprised of a humidity sensor positioned near a hole on the housing that is sealed with a Goretex patch. This configuration allowed for maximum sensor responsiveness as well as reliable water resistance and durability.",
  "detail2": "We also tried multiple ways we could measure the amount of weight exerted on the egg, such as measuring the contact force with force resistive sensors and measuring egg deformation using strain gauges.",
  "detail3" : "To measure the applied temperature on the egg, we chose to use an array of Infrared-red temperature sensors positions around different parts of the egg to create a \"heat map\".",
  "user1": "The users of our product are the penguin handlers at The Shedd Aquarium, most of whom do not have a background in electronics. Our design would therefore have to be easily operatable and maintainable.\n\nWe therefore designed our components to be easily replaceable and held by a removeable scaffold. We also chose to use rechargeble AAA batteries as they are readily available in the consumer market.",
  "user2": "As most of the handlers are equipped with basic Excel skills, we created the data visualisation tool in the form of an excel template that allows the handlers to simply input the raw data saved in a SD card to visualise the data in a more useful manner. "
}